Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetHVACLoadType
Get the element id for the HVACLAOD type associated with this space.
Returns:
The element id for the HVACLAOD type associated with this space.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetConnectedZoneEquipment
Get all the HVAC zone equipment attached to this space.
Returns:
The HVAC zone equipment attached to this space.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetBoundary
Gets the collection of polygons that form the 2D boundary.
This method returns a collection of polyloops (planar
polygons) that defines an enclosed area measured by
interior bounding surfaces, if in rooms and spaces mode.
In other modes, returns no polyloops.
Returns:
The collection of polygons that form the 2D boundary.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetClosedShell
Gets the collection of polygons that form a closed shell.
This method returns a collection of polyloops (planar
polygons) that defines an enclosed volume measured by
interior bounding surfaces, if in rooms and spaces mode.
In other modes, returns no polyloops.
Returns:
the collection of polygons that form a closed shell.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.CADObjectUniqueId
The unique id of the originating Element associated with this EnergyAnalysisSpace at the time of EAM creation.
Remarks:
This unique id can be passed to the Document.GetElement(string) method.
This EnergyAnalysisSpace may have been created form Autodesk.Revit.DB.Architecture.Room, or Autodesk.Revit.DB.Mechanical.Space elements.
If this EnergyAnalysisSpace was not created from a room or a space the CADObjectUniqueId will be the same as EnergyAnalysisSpace.UniqueId.
CADObjectUniqueId is unrelated to the CADObjectId element in gbxml.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.SpatialElementId
The id of the element that generated this space.
Remarks:
This EnergyAnalysisSpace may have been created form Autodesk.Revit.DB.Architecture.Room, or Autodesk.Revit.DB.Mechanical.Space elements.
If this EnergyAnalysisSpace was not created from a room or a space the SpatialElementId will be the same as EnergyAnalysisSpace.Id.
Refers to the same element as CADObjectUniqueId.
Since:
2012